# Intro to dataframes

In [1]:
import pandas as pd
import numpy as np

## Create a dataframe

## 1. Using list

In [7]:
df_list = pd.DataFrame([11, 22, 33, 44, 55])

df_list

    0
0  11
1  22
2  33
3  44
4  55

## 2. Using nested list

In [8]:
df_nested_list = pd.DataFrame([['Robert', 98], ['Alex', 97], ['Craig', 96]])

df_nested_list

        0   1
0  Robert  98
1    Alex  97
2   Craig  96

In [21]:
nested_list = [['Robert', 98], ['Alex', 97], ['Craig', 96]]

df_nested_list_2 = pd.DataFrame(nested_list, columns=['Name', 'Score'])

df_nested_list_2

     Name  Score
0  Robert     98
1    Alex     97
2   Craig     96

## 3. Using dictionary

In [10]:
df_dict = pd.DataFrame({'Name' : ['Robert', 'Alex', 'Craig'],
                        'Score': [98, 97, 96]})

df_dict

     Name  Score
0  Robert     98
1    Alex     97
2   Craig     96

## 4. Using numpy array

In [12]:
array = np.array([[1, 2, 3],
                 [4, 5, 6],
                 [7, 8, 9]])

df_array = pd.DataFrame(array, columns=['a', 'b', 'c'], index=[0, 1, 2])

df_array

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

## 5. Using series

In [5]:
series_1 = pd.Series([11, 22, 33, 44, 55])

series_1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [6]:
dataframe_1 = pd.DataFrame(series_1)

dataframe_1

    0
0  11
1  22
2  33
3  44
4  55

In [13]:
series_2 = pd.Series(['v', 'w', 'x', 'y', 'z'])

In [14]:
dict_series = {'First' : series_1, 'Second' : series_2}

dataframe_2 = pd.DataFrame(dict_series)

dataframe_2

   First Second
0     11      v
1     22      w
2     33      x
3     44      y
4     55      z

In [18]:
dict_students = {'Name' : ['Robert', 'Alex', 'Craig'],
                 'Score': [98, 97, 96]}

In [25]:
dataframe_3 = pd.DataFrame(dict_students, index=['Student 1', 'Student 2', 'Student 3'])

dataframe_3

             Name  Score
Student 1  Robert     98
Student 2    Alex     97
Student 3   Craig     96

## 6. Alter datatypes

In [32]:
dataframe_4 = pd.DataFrame(dict_students, columns=['Name', 'Score'], index=("Student 1", "Student 2", 'Student 3'))

dataframe_4

             Name  Score
Student 1  Robert     98
Student 2    Alex     97
Student 3   Craig     96

In [34]:
dataframe_4['Score Float'] = dataframe_4['Score'].astype('float')

dataframe_4

             Name  Score  Score Int  Score Float
Student 1  Robert     98         98         98.0
Student 2    Alex     97         97         97.0
Student 3   Craig     96         96         96.0

## 7. Exercise

In [35]:
city_temp_list = [['San Francisco', 30.1], ['Los Angeles', 32.2], ['Sacramento', '28.5']]

In [36]:
city_temp_df = pd.DataFrame(city_temp_list, columns=['City', 'Temperature'], index=[0, 1, 2])

In [37]:
city_temp_df

            City Temperature
0  San Francisco        30.1
1    Los Angeles        32.2
2     Sacramento        28.5